using BAL.Interface;
using Model.DB;
using Model.DTO;
using System;
using System.Collections.Generic;
using System.Data;
using System.Data.SqlClient;
using System.Globalization;
using System.IO;
using System.Linq;
using System.Web.Mvc;
using System.Web.Services;
using System.Xml.Serialization;
using WebApp.Models;
using PagedList;
using AutoMapper;

namespace WebApp.Controllers
{
	public class HomeController : BaseController
	{
		private ICategoryManager categoryManager;
		private IWebShopManager shopManager;
		private IPropertyManager propertyManager;
		private IGoodManager goodManager;
		private IPriceManager priceManager;
	    private IElasticManager elasticManager;
	 

		public HomeController(IElasticManager elasticManager, ICategoryManager categoryManager, IGoodManager goodManager, IPropertyManager propertyManager, IWebShopManager shopManager, IPriceManager priceManager)
		{
			this.priceManager = priceManager;
			this.categoryManager = categoryManager;
			this.goodManager = goodManager;
			this.propertyManager = propertyManager;
			this.shopManager = shopManager;
		    this.elasticManager = elasticManager;
		}

		public ActionResult Index(int? page)
		{
            //Good good1 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Розчин для ін'єкцій, 75 мг/3 мл по 3 мл в ампулах № 5</Value></Item><Item><Key>2</Key><Value>КРКА, д.д., Ново место, Словенія</Value></Item><Item><Key>3</Key><Value>не застосовувати дітям</Value></Item><Item><Key>4</Key><Value>Препарат при внутрішньом’язовому введенні призначений для лікування: Запальних та дегенеративних форм ревматизму, ревматоїдного артриту, анкілозуючого спондиліту, остеоартриту, спондилоартриту, вертебрального больового синдрому, несуглобового ревматизму; гострих нападів подагри; ниркової та біліарної колік; болю та набряку після травм і операцій; тяжких нападів мігрені. Препарат при введенні у вигляді внутрішньовенних інфузій призначений для лікування або профілактики післяопераційного болю.</Value></Item><Item><Key>5</Key><Value>Відома гіперчутливість до діючої речовини, натрію метабісульфіту або до будь-яких інших компонентів препарату. Кровотеча або перфорація шлунково-кишкового тракту в анамнезі, пов’язана з попереднім лікуванням нестероїдними протизапальними засобами (НПЗЗ). Активна форма виразкової хвороби/кровотечі або рецидивуюча виразкова хвороба/кровотеча в анамнезі (два або більше окремих епізоди встановленої виразки або кровотечі). Печінкова недостатність. Ниркова недостатність. Застійна серцева недостатність (NYHA ІІ-ІV). III триместр вагітності. Як і інші НПЗЗ, диклофенак також протипоказаний пацієнтам, у яких застосування ібупрофену, ацетилсаліцилової кислоти або інших нестероїдних протизапальних препаратів провокує напади бронхіальної астми, ангіоневротичного набряку, кропив’янки або гострого риніту. Запальні захворювання кишечнику (наприклад хвороба Крона або виразковий коліт). Високий ризик розвитку післяопераційних кровотеч, незгортання крові, порушень гемостазу, гемопоетичних порушень чи цереброваскулярних кровотеч. Лікування періопераційного болю при аортокоронарному шунтуванні (або використання апарату штучного кровообігу). Ішемічна хвороба серця у пацієнтів, які мають стенокардію, перенесений інфаркт міокарда. Цереброваскулярні захворювання у пацієнтів, які перенесли інсульт або мають епізоди транзиторних ішемічних атак. Захворювання периферичних артерій. У даній лікарській формі препарат протипоказаний дітям. Тільки щодо внутрішньовенного застосування. Одночасне застосування НПЗЗ або антикоагулянту (в тому числі низьких доз гепарину). Наявність в анамнезі геморагічного діатезу, підтверджена або підозрювана цереброваскулярна кровотеча в анамнезі. Операції, пов’язані з високим ризиком кровотечі. Бронхіальна астма в анамнезі. Помірне або тяжке порушення функцій нирок (креатинін сироватки крові > 160 мкмоль/л). Гіповолемія або зневоднення з будь-якої причини.</Value></Item><Item><Key>6</Key><Value>діюча речовина: 3 мл розчину (1 ампула) містять диклофенаку натрію – 75 мг; допоміжні речовини: спирт бензиловий, пропіленгліколь, натрію метабісульфіт (Е 223), натрію гідроксид, вода для ін’єкцій.</Value></Item><Item><Key>7</Key><Value>5 роки</Value></Item><Item><Key>8</Key><Value>НАКЛОФЕН</Value></Item><Item><Key>9</Key><Value>ампула</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні та протиревматичні засоби. Диклофенак. Код АТХ М01А В05.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Наклофен 75 мг/3 мл N5 раствор",
            //    Price = 68.2m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/31b/650_400_1/31b8c50201d1f3bf9690239eea338eb7.jpg",
            //    UrlLink = "https://www.apteka24.ua/naklofen-75-mg-3-ml-n5/",
            //    Description = "Наклофен является нестероидным противовоспалительным препаратом (НПВП) для местного применения, обладающим выраженным анальгезирующим и противовоспалительным свойствами.",
            //    OldPrice = 70m
            //};
            //Good good2 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки шипучі № 10 (2х5) у стрипах</Value></Item><Item><Key>2</Key><Value>Байєр Біттерфельд ГмбХ, Німеччина</Value></Item><Item><Key>3</Key><Value>Препарат застосовують дітям віком від 15 років.</Value></Item><Item><Key>4</Key><Value>Незначний або помірний біль, такий як головний біль, зубний біль, періодичні болі у жінок, больові симптоми, пов’язані з застудою (наприклад, головний біль, біль у горлі, біль у кінцівках). -Гарячка.</Value></Item><Item><Key>5</Key><Value>	Гіперчутливість до ацетилсаліцилової кислоти, інших саліцилатів, аскорбінової кислоти або до будь-якого компонента препарату. - Бронхіальна астма, спричинена застосуванням саліцилатів або інших НПЗЗ в анамнезі. - Гострі шлунково-кишкові виразки. - Геморагічний діатез. - Тяжкі захворювання нирок; виражена ниркова недостатність. - Сечокам’яна хвороба. - Виражена печінкова недостатність. - Виражена серцева недостатність. - Схильність до тромбозів, тромбофлебіт. - Цукровий діабет. - Комбінація з метотрексатом у дозуванні 15 мг/тиждень або більше (див. розділ «Взаємодія з іншими лікарськими засобами та інші види взаємодій»).</Value></Item><Item><Key>6</Key><Value>діючі речовини: ацетилсаліцилова кислота та аскорбінова кислота; 1 таблетка містить 400 мг ацетилсаліцилової кислоти та 240 мг аскорбінової кислоти (вітаміну С); допоміжні речовини: натрію дигідроцитрат, натрію гідрокарбонат, кислота лимонна безводна, натрію карбонат безводний.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>АСПІРИН® С</Value></Item><Item><Key>9</Key><Value>	Стрип</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Кислота ацетилсаліцилова. Код АТХ N02В А01.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Аспирин C №10 таблетки шипучие",
            //    Price = 68.2m,
            //    ImgLink = "https://www.apteka24.ua/upload/iblock/d13/d13b9fe9ab6e453f536caf8f234df55d.jpg",
            //    UrlLink = "https://www.apteka24.ua/aspirin-s-n10/",
            //    Description = "Шипучие таблетки Аспирин С №10 - это всем хорошо известное средство, которое отменно борется с головной и зубной болью, а также эффективно устраняет мышечные и суставные боли. Относится данный препарат к группе анальгетиков и антипиретиков и содержит ацетилсалициловую кислоту. Именно за счет данного компонента и осуществляется его терапевтический эффект."
            //};
            //Good good3 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Супозиторії по 25 мг № 10 (5х2)</Value></Item><Item><Key>2</Key><Value>Делфарм Хюнінг С.А.С., Франція</Value></Item><Item><Key>3</Key><Value>Вольтарен® не застосовують дітям віком до 1 року. Дітям віком 1-14 років з ювенільним хронічним артритом супозиторії призначають лише у дозі 25 мг. У дітей віком 6-14 років з гострим післяопераційним болем супозиторії призначають лише у дозі 25 мг. Підліткам віком від 14 років можна призначати супозиторії по 50 мг. Супозиторії Вольтарен® у дозі 100 мг не застосовують для лікування дітей та підлітків внаслідок високого вмісту активної речовини.</Value></Item><Item><Key>4</Key><Value>Запальні і дегенеративні форми ревматизму: ревматоїдний артрит, ювенільний ревматоїдний артрит, анкілозуючий спондиліт, остеоартрит, включаючи спондилоартрит; · больові синдроми з боку хребта; · ревматичні захворювання позасуглобових м’яких тканин; · посттравматичні і післяопераційні больові синдроми, що супроводжуються запаленням і набряком, зокрема після стоматологічних та ортопедичних операцій; · гінекологічні захворювання, які супроводжуються больовим синдромом і запаленням, наприклад первинна дисменорея та аднексит; · напади мігрені; · гострі напади подагри; · як допоміжний засіб при тяжких запальних захворюваннях ЛОР-органів, які супроводжуються болісним відчуттям, наприклад при фаринготонзиліті, отиті. Відповідно до загальних терапевтичних принципів, основне захворювання слід лікувати засобами базисної терапії. Гарячка сама по собі не є показанням для застосування препарату</Value></Item><Item><Key>5</Key><Value>Гіперчутливість до діючої речовини або будь-якої допоміжної речовини; · кровотеча або перфорація шлунково-кишкового тракту в анамнезі, що пов’язані з попереднім лікуванням НПЗП; · активна форма виразкової хвороби/кровотечі або рецидивуюча виразкова хвороба/кровотеча в анамнезі (два або більше окремих епізода встановленої виразки або кровотечі); · останній триместр вагітності; · запальні захворювання кишечнику (наприклад, хвороба Крона або виразковий коліт); · печінкова недостатність; · ниркова недостатність; · застійна серцева недостатність (NYHA II-IV); · лікування періопераційного болю при аорто-коронарному шунтуванні (або використання апарату штучного кровообігу). · ішемічна хвороба серця у пацієнтів, які мають стенокардію, перенесли інфаркт міокарда; · цереброваскулярні захворювання у пацієнтів, які перенесли інсульт або мають епізоди транзиторних ішемічних атак; · захворювання периферичних артерій; · Вольтарен?, як і інші нестероїдні протизапальні препарати (НПЗП), протипоказаний пацієнтам, у яких у відповідь на прийом ацетилсаліцилової кислоти або інших НПЗП виникають напади бронхіальної астми, кропив’янка, ангіоневротичний набряк або гострий риніт; · проктит.</Value></Item><Item><Key>6</Key><Value>діюча речовина: 1 супозиторій містить диклофенаку натрію 25 мг, 50 мг або 100 мг; допоміжна речовина: жир твердий</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>ВОЛЬТАРЕН®</Value></Item><Item><Key>9</Key><Value>у стрипах у картонній коробці</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні та протиревматичні засоби.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Вольтарен 50 мг №10 свечи",
            //    Price = 110.47m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/2ea/650_400_1/2ea193246b3551ac18a9afa85c8164f3.JPG",
            //    UrlLink = "https://www.apteka24.ua/voltaren-50-mg-n10/",
            //    Description = "Суппозитории Вольтарен 50 мг № 10 представляют собой высокоэффективное средство на основе противовоспалительных нестероидных компонентов, в особенности диклофенака натрия. Данный препарат наиболее часто находит применение в медицинской практике в целях ликвидации воспалительного процесса и болезненных проявлений."
            //};
            //Good good4 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки шипучі № 10 (2х5) у стрипах</Value></Item><Item><Key>2</Key><Value>Байєр Біттерфельд ГмбХ, Німеччина</Value></Item><Item><Key>3</Key><Value>Препарат застосовують дітям віком від 15 років.</Value></Item><Item><Key>4</Key><Value>	Незначний або помірний біль, такий як головний біль, зубний біль, періодичні болі у жінок, больові симптоми, пов’язані з застудою (наприклад, головний біль, біль у горлі, біль у кінцівках). -Гарячка.</Value></Item><Item><Key>5</Key><Value>Гіперчутливість до ацетилсаліцилової кислоти, інших саліцилатів, аскорбінової кислоти або до будь-якого компонента препарату. - Бронхіальна астма, спричинена застосуванням саліцилатів або інших НПЗЗ в анамнезі. - Гострі шлунково-кишкові виразки. - Геморагічний діатез. - Тяжкі захворювання нирок; виражена ниркова недостатність. - Сечокам’яна хвороба. - Виражена печінкова недостатність. - Виражена серцева недостатність. - Схильність до тромбозів, тромбофлебіт. - Цукровий діабет. - Комбінація з метотрексатом у дозуванні 15 мг/тиждень або більше (див. розділ «Взаємодія з іншими лікарськими засобами та інші види взаємодій»).</Value></Item><Item><Key>6</Key><Value>	діючі речовини: ацетилсаліцилова кислота та аскорбінова кислота; 1 таблетка містить 400 мг ацетилсаліцилової кислоти та 240 мг аскорбінової кислоти (вітаміну С); допоміжні речовини: натрію дигідроцитрат, натрію гідрокарбонат, кислота лимонна безводна, натрію карбонат безводний.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>ЦИТРАМОН В</Value></Item><Item><Key>9</Key><Value>Стрип</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Кислота ацетилсаліцилова. Код АТХ N02В А01.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Цитрамон-Дарница №6 таблетки",
            //    Price = 5.95m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/556/650_400_1/556ac4515293e2cdeec7a60470f46c90.jpg",
            //    UrlLink = "https://www.apteka24.ua/tsitramon-darnitsa-n6/",
            //    Description = "Препарат Цитрамон-Дарница — это недорогое и эффективное лекарство, которое успешно снимает болевой синдром различной этиологии. Это ненаркотический препарат, поэтому применение Цитрамона возможно даже во время беременности (исключая первый и третий триместры). Цитрамон является комбинированным препаратом, в состав которого входит ацетилсалициловая кислота (аспирин), кофеин и парацетамол. Описание действия препарата Цитрамон говорит о том, что он не только купирует болевой синдром, но и обладает жаропонижающим, сосудорасширяющим и противовоспалительным действием."
            //};
            //Good good5 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Розчин для ін'єкцій, 75 мг/3 мл по 3 мл в ампулі № 5</Value></Item><Item><Key>2</Key><Value>А. Менаріні Мануфактурінг Логістікс енд Сервісес С.р.Л., Італія</Value></Item><Item><Key>3</Key><Value>не застосовувати дітям</Value></Item><Item><Key>4</Key><Value>Препарат при внутрішньом’язовому введенні призначений для лікування: запальних та дегенеративних форм ревматизму, ревматоїдного артриту, анкілозуючого спондиліту, остеоартриту, спондилоартриту, вертебрального больового синдрому, несуглобового ревматизму; гострих нападів подагри; ниркової та біліарної колік; болю та набряку після травм і операцій; тяжких нападів мігрені.</Value></Item><Item><Key>5</Key><Value>	Кровотеча або перфорація шлунково-кишкового тракту в анамнезі, пов’язана з попереднім лікуванням нестероїдними протизапальними засобами (НПЗЗ). Активна форма виразкової хвороби/кровотечі або рецидивна виразкова хвороба/кровотеча в анамнезі (два або більше окремих епізоди встановленої виразки або кровотечі). III триместр вагітності. Як і інші НПЗЗ, диклофенак також протипоказаний пацієнтам, у яких застосування ібупрофену, ацетилсаліцилової кислоти або інших нестероїдних протизапальних препаратів провокує напади бронхіальної астми, ангіоневротичного набряку, кропив’янки або гострого риніту. Запальні захворювання кишечнику (наприклад хвороба Крона або виразковий коліт). Печінкова недостатність. Ниркова недостатність. Захворювання периферичних артерій. Цереброваскулярні захворювання у пацієнтів, які перенесли інсульт або мають епізоди транзиторних ішемічних атак. Ішемічна хвороба серця у пацієнтів, які мають стенокардію або перенесли інфаркт міокарда. Застійна серцева недостатність (NYHA II–IV). Високий ризик розвитку післяопераційних кровотеч, незгортання крові, порушень гемостазу, гемопоетичних порушень чи цереброваскулярних кровотеч. Лікування періопераційного болю при аортокоронарному шунтуванні (або використання апарату штучного кровообігу).</Value></Item><Item><Key>6</Key><Value>	діюча речовина: 1 мл розчину для ін’єкцій містить 25 мг диклофенаку натрію (1 ампула містить 3 мл розчину для ін’єкцій, що дорівнює 75 мг диклофенаку натрію); допоміжні речовини: пропіленгліколь, спирт бензиловий, ацетилцистеїн, маніт (E 421), натрію гідроксид, вода для ін’єкцій.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>ДИКЛОБЕРЛ® N 75</Value></Item><Item><Key>9</Key><Value>ампула</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні та протиревматичні засоби. Похідні оцтової кислоти та споріднені сполуки. Код АТХ M01A B05.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Диклоберл 75 мг 3 мл №5 раствор",
            //    Price = 107.3m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/c36/650_400_1/c367af9e27d70f213513ae6d08ba2722.jpg",
            //    UrlLink = "https://www.apteka24.ua/dikloberl-75-mg-3-ml-n5/",
            //    Description = "Препарат Диклоберл 75 мг 3 мл №5 является нестероидным противовоспалительным средством с выраженным противовоспалительным действием, обусловленным ингибированием синтезации простагландинов. Эффект препарата наступает благодаря входящему в его состав действующему веществу диклофенаку.  "
            //};
            //Good good6 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки по 15 мг № 10 (10х1), № 20 (10х2) у блістерах</Value></Item><Item><Key>2</Key><Value>Берінгер Інгельхайм Фарма ГмбХ і Ко. КГ, Німеччина Берінгер Інгельхайм Еллас А.Е., Греція</Value></Item><Item><Key>3</Key><Value>протипоказаний дітям віком до 16 років</Value></Item><Item><Key>4</Key><Value>Короткотривале симптоматичне лікування загострення остеоартрозу. Довготривале симптоматичне лікування ревматоїдного артриту та анкілозивного спондиліту</Value></Item><Item><Key>5</Key><Value>Гіперчутливість до мелоксикаму або до інших складових лікарського засобу, або до активних речовин з подібною дією, таких як нестероїдні протизапальні лікарські засоби (НПЗП), аспірин. Мелоксикам не слід призначати пацієнтам, у яких виникали симптоми аст</Value></Item><Item><Key>6</Key><Value>1 таблетка містить мелоксикаму 7,5 мг або 15 мг; допоміжні речовини: натрію цитрат, лактози моногідрат, целюлоза мікрокристалічна, повідон, кремнію діоксид колоїдний безводний, кросповідон, магнію стеарат</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>МОВАЛІС</Value></Item><Item><Key>9</Key><Value>блістер</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні препарати та протиревматичні засоби</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Мовалис 15 мг №10 таблетки",
            //    Price = 219.05m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/cde/650_400_1/cde564d74fa2c2e7824eda2c966af1f2.JPG",
            //    UrlLink = "https://www.apteka24.ua/movalis-15-mg-n10/",
            //    Description = "Мовалис 15 мг № 10 в таблетках является противовоспалительным нестероидным препаратом с мягким действием. "
            //};
            //Good good7 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Порошок для орального розчину у пакетиках № 5, № 10 у картонній коробці</Value></Item><Item><Key>2</Key><Value>СмітКляйн Бічем С.А., Іспанія</Value></Item><Item><Key>3</Key><Value>від 12 років</Value></Item><Item><Key>4</Key><Value>Короткочасне полегшення симптомів застудних захворювань і грипу, таких як головний біль, біль у горлі, закладеність носа, синусити та біль, пов’язаний з ними, ломота та біль у тілі, гарячка.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до будь-якого з компонентів препарату. Тяжкі порушення функції печінки і/або нирок; вроджена гіпербілірубінемія; дефіцит глюкозо-6-фосфатдегідрогенази, рідкісні спадкові форми непереносимості фруктози, порушення всмоктування глюкози-галактози або недостатності цукрози-ізомальтози. Алкоголізм. Захворювання крові, виражена анемія, лейкопенія, тромбоз, тромбофлебіт. Стани підвищеного збудження, порушення сну. Тяжка артеріальна гіпертензія; органічні захворювання серцево-судинної системи (в тому числі атеросклероз); декомпенсована серцева недостатність; порушення серцевої провідності; схильність до спазму судин; ішемічна хвороба серця. Закритокутова глаукома. Гострий панкреатит. Гіпертрофія передміхурової залози. Тяжкі форми цукрового діабету. Епілепсія. Гіпертиреоз. Не застосовувати одночасно та протягом 2 тижнів після застосування інгібіторів МАО, препарат протипоказаний пацієнтам, які приймають трициклічні антидепресанти, бета-блокатори або інші антигіпертензивні препарати, амфетаміноподібні психостимулятори та лікарські засоби, що пригнічують або підвищують апетит. Дитячий вік до 12 років, вагітність, годування груддю.</Value></Item><Item><Key>6</Key><Value>діючі речовини: 1 пакетик містить парацетамолу 1000 мг, фенілефрину гідрохлориду 10 мг, кислоти аскорбінової 40 мг; допоміжні речовини: сахароза, кислота лимонна безводна, натрію цитрат, крохмаль кукурудзяний, натрію цикламат, сахарин натрію, кремнію діоксид колоїдний безводний, ароматизатор лимонний, куркумін (E 100).</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>КОЛДРЕКС® МАКСГРИП ЛИМОН</Value></Item><Item><Key>9</Key><Value>пакет</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Код АТС N02B E51.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Колдрекс МаксГрип лимон №10 порошок для орального раствора",
            //    Price = 142.07m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/61c/650_400_1/61c3f748b6db0119575426607186fe52.jpg",
            //    UrlLink = "https://www.apteka24.ua/koldreks-maksgrip-limon-pak-n10/",
            //    Description = "Колдрекс МаксГрип – расфасованный в пакеты-саше порошок для приготовления горячего напитка. По 10 пакетиков в упаковке. Комбинированный состав саше-пакетов подобран для оказания первого симптоматического лечения при наступлении простудного состояния, ОРВИ, гриппа. Инструкция, содержащая все необходимые сведения о составе лекарства Колдрекс МаксГрип, описание действия его компонентов, правила разведения и применения средства и прочее, написана доступным и понятным стилем."
            //};
            //Good good8 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки по 4 таблетки у стрипі; по 1 стрипу в паперовому конверті; по 4 таблетки у стрипі; по 3 стрипи у картонній коробці; по 4 таблетки у стрипі; по 1 стрипу в паперовому конверті; по 50 конвертів у картонній коробці</Value></Item><Item><Key>2</Key><Value>Наброс Фарма Пвт. Лтд., Індія</Value></Item><Item><Key>3</Key><Value>от 12 лет</Value></Item><Item><Key>4</Key><Value>Симптоматичне лікування застуди та грипу, які супроводжуються підвищеною температурою тіла, ознобом, головним болем, нежитем та закладеністю носа, чханням, ломотою та болем у тілі.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до компонентів препарату, інших похідних ксантинів (теофілін, теобромін). Тяжкі серцево-судинні захворювання, включаючи порушення провідності, виражений атеросклероз, тяжку форму ішемічної хвороби серця. Тяжкі порушення функції печінки та/або нирок, вроджена гіпербілірубінемія, тяжка артеріальна гіпертензія; аденома простати з утрудненим сечовипусканням; обструкція шийки сечового міхура; захворювання крові, виражена анемія, лейкопенія, гіпертиреоз, пілородуоденальна обструкція, цукровий діабет, бронхіальна астма, закритокутова глаукома, дефіцит глюкозо-6-фосфатдегідрогенази, алкоголізм, підвищена збудливість, порушення сну, супутнє лікування інгібіторами МАО та протягом 2 тижнів після припинення їх застосування. Літній вік.</Value></Item><Item><Key>6</Key><Value>1 таблетка містить парацетамолу 500 мг, кофеїну 30 мг, фенілефрину гідрохлориду 5 мг, хлорфеніраміну малеату 2 мг; допоміжні речовини: крохмаль кукурудзяний, натрію крохмальгліколят (тип А), тальк, желатин, магнію стеарат, сорбіту розчин (Е 420), Повідон К-30, натрію бензоат (Е 211), барвник Ponceau 4R (Е 124), вода очищена.</Value></Item><Item><Key>7</Key><Value>4 роки</Value></Item><Item><Key>8</Key><Value>ФЛЮКОЛД®-N</Value></Item><Item><Key>9</Key><Value>стрипу в паперовому конверті</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Парацетамол, комбінації без психолептиків</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Флюколд-N №200 таблетки",
            //    Price = 740.7m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/d03/650_400_1/d03375446ff3d453fd785dc5c74083ab.JPG",
            //    UrlLink = "https://www.apteka24.ua/flyukold-n-n200/",
            //    Description = "Медицинский препарат Флюколд-N №200 обладает жаропонижающими, обезболивающими и антигистаминными свойствами. Его высокая терапевтическая эффективность связана с тем, что в его составе не одно активное вещество, а четыре – парацетомол, кофеин, гидрохлорид фенилэфрина, хлорфенирамина малеат. Каждый из компонентов обладает своим действием и усиливает эффект других."
            //};
            //Good good9 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки шипучі № 10 (2х5) у стрипах</Value></Item><Item><Key>2</Key><Value>Байєр Біттерфельд ГмбХ, Німеччина</Value></Item><Item><Key>3</Key><Value>Препарат застосовують дітям віком від 15 років.</Value></Item><Item><Key>4</Key><Value>Незначний або помірний біль, такий як головний біль, зубний біль, періодичні болі у жінок, больові симптоми, пов’язані з застудою (наприклад, головний біль, біль у горлі, біль у кінцівках). -Гарячка.</Value></Item><Item><Key>5</Key><Value>	Гіперчутливість до ацетилсаліцилової кислоти, інших саліцилатів, аскорбінової кислоти або до будь-якого компонента препарату. - Бронхіальна астма, спричинена застосуванням саліцилатів або інших НПЗЗ в анамнезі. - Гострі шлунково-кишкові виразки. - Геморагічний діатез. - Тяжкі захворювання нирок; виражена ниркова недостатність. - Сечокам’яна хвороба. - Виражена печінкова недостатність. - Виражена серцева недостатність. - Схильність до тромбозів, тромбофлебіт. - Цукровий діабет. - Комбінація з метотрексатом у дозуванні 15 мг/тиждень або більше (див. розділ «Взаємодія з іншими лікарськими засобами та інші види взаємодій»).</Value></Item><Item><Key>6</Key><Value>діючі речовини: ацетилсаліцилова кислота та аскорбінова кислота; 1 таблетка містить 400 мг ацетилсаліцилової кислоти та 240 мг аскорбінової кислоти (вітаміну С); допоміжні речовини: натрію дигідроцитрат, натрію гідрокарбонат, кислота лимонна безводна, натрію карбонат безводний.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>Цитропак® С</Value></Item><Item><Key>9</Key><Value>Стрип</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Кислота ацетилсаліцилова. Код АТХ N02В А01.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Цитропак-Дарница №6 таблетки",
            //    Price = 5.95m,
            //    ImgLink = "https://www.apteka24.ua/upload/iblock/1fe/1fea3f0d15a9332e62390e133e095390.jpg",
            //    UrlLink = "https://www.apteka24.ua/tsitropak-darnitsa-tabletki-n6/",
            //    Description = "Комбинированный препарат Цитропак-Дарница №6 относится к антипиретикам и анальгетикам и содержит в своем составе ацетилсалициловую кислоту. "
            //};
            //Good good10 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки по 15 мг № 10 (10х1), № 20 (10х2) у блістерах</Value></Item><Item><Key>2</Key><Value>Берінгер Інгельхайм Фарма ГмбХ і Ко. КГ, Німеччина Берінгер Інгельхайм Еллас А.Е., Греція</Value></Item><Item><Key>3</Key><Value>протипоказаний дітям віком до 16 років</Value></Item><Item><Key>4</Key><Value>Короткотривале симптоматичне лікування загострення остеоартрозу. Довготривале симптоматичне лікування ревматоїдного артриту та анкілозивного спондиліту</Value></Item><Item><Key>5</Key><Value>Гіперчутливість до мелоксикаму або до інших складових лікарського засобу, або до активних речовин з подібною дією, таких як нестероїдні протизапальні лікарські засоби (НПЗП), аспірин. Мелоксикам не слід призначати пацієнтам, у яких виникали симптоми аст</Value></Item><Item><Key>6</Key><Value>1 таблетка містить мелоксикаму 7,5 мг або 15 мг; допоміжні речовини: натрію цитрат, лактози моногідрат, целюлоза мікрокристалічна, повідон, кремнію діоксид колоїдний безводний, кросповідон, магнію стеарат</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>МОВАЛІС</Value></Item><Item><Key>9</Key><Value>блістер</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні препарати та протиревматичні засоби</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Мовалис 15 мг №20 таблетки",
            //    Price = 399.96m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/0d3/650_400_1/0d306c2a5f77bc7b4fb6a00bb96a2089.JPG",
            //    UrlLink = "https://www.apteka24.ua/movalis-15-mg-n20/",
            //    Description = "Мовалис 15 мг №20 – таблетки для приема внутрь, круглой формы с наличием риски. Основной действующий компонент, присутствием которого объясняется оказываемый эффект – мелоксикам. Также в составе присутствуют иные компоненты, являющиеся вспомогательными. Препарат оказывает противовоспалительное и легкое обезболивающее действия, может входить в состав комплексной терапии. "
            //};
            //Good good11 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки № 10 (10х1), № 20 (10х2), № 20 (20х1), № 50 (10х5) у блістерах у коробці</Value></Item><Item><Key>2</Key><Value>Балканфарма-Дупниця АТ, Болгарія Фармацевтична і Хімічна Індустрія, Здравлє АТ, Сербія</Value></Item><Item><Key>3</Key><Value>Спазмалгон не призначають дітям віком до 15 років.</Value></Item><Item><Key>4</Key><Value>Симптоматичне лікування слабко та помірно вираженого больового синдрому при спазмах гладких м’язів внутрішніх органів: · ниркова коліка та запальні захворювання сечовивідних шляхів, які перебігають з болем та дизурійними розладами; · спазми шлунка та кишечнику, печінкова коліка, дискінезії жовчних шляхів; · спастична дисменорея.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до метамізолу, до похідних піразолону та/або до будь-якого компонента лікарського засобу. Шлунково-кишкова непрохідність та мегаколон; атонія жовчного або сечового міхура; тяжкі порушення функції нирок та печінки; зміна складу периферичної крові (агранулоцитоз, лейкопенія); захворювання крові (анемія будь-якої етіології, цитостатична чи інфекційна нейтропенія); дефіцит глюкозо-6-фосфатдегідрогенази; порфірія печінки; закритокутова глаукома; підозра на гостру хірургічну патологію; бронхіальна астма; колаптоїдні стани; тахіаритмія; гіпертрофія передміхурової залози з тенденцією до затримки сечі.</Value></Item><Item><Key>6</Key><Value>	діючі речовини: 1 таблетка містить метамізолу натрію 500 мг, пітофенону гідрохлориду 5 мг, фенпіверинію броміду 0,1 мг; допоміжні речовини: лактози моногідрат, крохмаль пшеничний, тальк, магнію стеарат, желатин, натрію гідрокарбонат.</Value></Item><Item><Key>7</Key><Value>2 роки</Value></Item><Item><Key>8</Key><Value>СПАЗМАЛГОН</Value></Item><Item><Key>9</Key><Value>блістер</Value></Item><Item><Key>10</Key><Value>Спазмолітичні засоби в комбінації з аналгетиками. Синтетичні антихолінергічні засоби в комбінації з аналгетиками. Пітофенон і аналгетики.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Спазмалгон №20 таблетки",
            //    Price = 51.7m,
            //    ImgLink = "https://www.apteka24.ua/upload/iblock/733/733e628c083d782017609f57bacf058f.jpg",
            //    UrlLink = "https://www.apteka24.ua/spazmalgon-n20/",
            //    Description = "Спазмалгон является сильным анальгезирующим и спазмолитическим препаратом. Такое комбинированное действие обеспечивают действующие вещества данного препарата — фенпивериния бромид, метамизол натрия и питофенона гидрохлорид. Применение Спазмалгона основано на фармакологических свойствах данных веществ. Так, фенпивериния бромид снижает тонус и снимает спазм внутренних органов, желудка и кишечника, а также мочевыводящих путей. Метамизол натрия обладает противовоспалительными и анальгезирующими свойствами, а питофенона гидрохлорид снижает тонус и снимает спазм гладкой мускулатуры."
            //};
            //Good good12 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки по 4 таблетки у стрипі; по 1 стрипу в паперовому конверті; по 4 таблетки у стрипі; по 3 стрипи у картонній коробці; по 4 таблетки у стрипі; по 1 стрипу в паперовому конверті; по 50 конвертів у картонній коробці</Value></Item><Item><Key>2</Key><Value>Наброс Фарма Пвт. Лтд., Індія</Value></Item><Item><Key>3</Key><Value>от 12 лет</Value></Item><Item><Key>4</Key><Value>Симптоматичне лікування застуди та грипу, які супроводжуються підвищеною температурою тіла, ознобом, головним болем, нежитем та закладеністю носа, чханням, ломотою та болем у тілі.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до компонентів препарату, інших похідних ксантинів (теофілін, теобромін). Тяжкі серцево-судинні захворювання, включаючи порушення провідності, виражений атеросклероз, тяжку форму ішемічної хвороби серця. Тяжкі порушення функції печінки та/або нирок, вроджена гіпербілірубінемія, тяжка артеріальна гіпертензія; аденома простати з утрудненим сечовипусканням; обструкція шийки сечового міхура; захворювання крові, виражена анемія, лейкопенія, гіпертиреоз, пілородуоденальна обструкція, цукровий діабет, бронхіальна астма, закритокутова глаукома, дефіцит глюкозо-6-фосфатдегідрогенази, алкоголізм, підвищена збудливість, порушення сну, супутнє лікування інгібіторами МАО та протягом 2 тижнів після припинення їх застосування. Літній вік.</Value></Item><Item><Key>6</Key><Value>1 таблетка містить парацетамолу 500 мг, кофеїну 30 мг, фенілефрину гідрохлориду 5 мг, хлорфеніраміну малеату 2 мг; допоміжні речовини: крохмаль кукурудзяний, натрію крохмальгліколят (тип А), тальк, желатин, магнію стеарат, сорбіту розчин (Е 420), Повідон К-30, натрію бензоат (Е 211), барвник Ponceau 4R (Е 124), вода очищена.</Value></Item><Item><Key>7</Key><Value>4 роки</Value></Item><Item><Key>8</Key><Value>Панадол®-N</Value></Item><Item><Key>9</Key><Value>стрипу в паперовому конверті</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Парацетамол, комбінації без психолептиків</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Панадол №12 таблетки",
            //    Price = 20.26m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/bb8/650_400_1/bb8450bf1239b16b5c920f41b825becd.JPG",
            //    UrlLink = "https://www.apteka24.ua/panadol-n12/",
            //    Description = "Таблетки Панадол относятся к разряду обезболивающих и жаропонижающих медикаментов на основе парацетамола. Довольно быстро и фактически полностью всасываясь в ЖКТ, в момент применения Панадол концентрируется в плазме крови, где вступает в реакцию с белками, по истечении получаса/часа и выводится посредством почек. "
            //};
            //Good good13 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Гель 2,5 % по 20 г, 30 г, 50 г, 100 г у тубах № 1, по 100 г у контейнері № 1 з механічним дозатором</Value></Item><Item><Key>2</Key><Value>А. Менаріні Мануфактурінг Логістікс енд Сервісес С.р.Л., Італія</Value></Item><Item><Key>3</Key><Value>Безпека та ефективність застосування препарату Фастум гель не встановлена для цієї вікової групи.</Value></Item><Item><Key>4</Key><Value>	Посттравматичний біль у м’язах та суглобах, запалення сухожиль.</Value></Item><Item><Key>5</Key><Value>Будь-які реакції фотосенсибілізації в анамнезі; – відомі реакції гіперчутливості, наприклад симптоми бронхіальної астми, алергічний риніт або кропив’янка, що виникли при застосуванні кетопрофену, фенофібрату, тіапрофенової кислоти, ацетилсаліцилової кислоти або інших нестероїдних протизапальних засобів; – наявність в анамнезі шкірних проявів алергії при застосуванні кетопрофену, тіапрофенової кислоти, фенофібрату, блокаторів ультрафіолетових (УФ) променів або парфумерних засобів; – вплив сонячних променів (навіть розсіяного світла) або УФ-опромінення у солярії під час лікування гелем та протягом 2 тижнів після його припинення; – гіперчутливість до будь-яких компонентів препарату; – гель не застосовувати при наявності патологічних змін на шкірі, наприклад мокнучі дерматози, пошкодження шкіри, висипання, травми шкіри, опіки, екзема або акне, або інфекційних процесів шкіри та відкритих ран; – ІІІ триместр вагітності.</Value></Item><Item><Key>6</Key><Value>діюча речовина: ketoprofen; 1 г гелю містить кетопрофену 0,025 г; допоміжні речовини: карбомер, етанол 96 %, олія неролієва, олія лавандинова, триетаноламін, вода очищена.</Value></Item><Item><Key>7</Key><Value>5 років</Value></Item><Item><Key>8</Key><Value>ФАСТУМ ГЕЛЬ</Value></Item><Item><Key>9</Key><Value>Контейнер з механічним дозатором</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні засоби для місцевого застосування.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Фастум 2.5% 30 г гель",
            //    Price = 73.9m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/5aa/650_400_1/5aaea07e6862e8317af7ddcddcef47d8.JPG",
            //    UrlLink = "https://www.apteka24.ua/fastum-gel-2-5-30g/",
            //    Description = "Фастум гель содержит кетопрофен как действующее вещество, способствуещее быстрому уменьшению поверхностных воспалительных процессов суставов, сухожилий, связок и мышц. Благодаря использованию специальной гелевой основы обеспечивается глубокое проникновение активного вещества в кожу и мягкие ткани без развития системных побочных эффектов. Фастум гель не вызывает явлений привыкания."
            //};
            //Good good14 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки по 4 таблетки у стрипі; по 1 стрипу в паперовому конверті; по 4 таблетки у стрипі; по 3 стрипи у картонній коробці; по 4 таблетки у стрипі; по 1 стрипу в паперовому конверті; по 50 конвертів у картонній коробці</Value></Item><Item><Key>2</Key><Value>Наброс Фарма Пвт. Лтд., Індія</Value></Item><Item><Key>3</Key><Value>от 12 лет</Value></Item><Item><Key>4</Key><Value>Симптоматичне лікування застуди та грипу, які супроводжуються підвищеною температурою тіла, ознобом, головним болем, нежитем та закладеністю носа, чханням, ломотою та болем у тілі.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до компонентів препарату, інших похідних ксантинів (теофілін, теобромін). Тяжкі серцево-судинні захворювання, включаючи порушення провідності, виражений атеросклероз, тяжку форму ішемічної хвороби серця. Тяжкі порушення функції печінки та/або нирок, вроджена гіпербілірубінемія, тяжка артеріальна гіпертензія; аденома простати з утрудненим сечовипусканням; обструкція шийки сечового міхура; захворювання крові, виражена анемія, лейкопенія, гіпертиреоз, пілородуоденальна обструкція, цукровий діабет, бронхіальна астма, закритокутова глаукома, дефіцит глюкозо-6-фосфатдегідрогенази, алкоголізм, підвищена збудливість, порушення сну, супутнє лікування інгібіторами МАО та протягом 2 тижнів після припинення їх застосування. Літній вік.</Value></Item><Item><Key>6</Key><Value>1 таблетка містить парацетамолу 500 мг, кофеїну 30 мг, фенілефрину гідрохлориду 5 мг, хлорфеніраміну малеату 2 мг; допоміжні речовини: крохмаль кукурудзяний, натрію крохмальгліколят (тип А), тальк, желатин, магнію стеарат, сорбіту розчин (Е 420), Повідон К-30, натрію бензоат (Е 211), барвник Ponceau 4R (Е 124), вода очищена.</Value></Item><Item><Key>7</Key><Value>4 роки</Value></Item><Item><Key>8</Key><Value>Дарница®-N</Value></Item><Item><Key>9</Key><Value>стрипу в паперовому конверті</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Парацетамол, комбінації без психолептиків</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Ацетилсалициловая кислота Дарница (Аспирин) №10 таблетки",
            //    Price = 6.15m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/352/650_400_1/352c0e5dd43d170e0a5caeeb23a47632.jpg",
            //    UrlLink = "https://www.apteka24.ua/atsetilsalitsilovaya-kislota-d-n10/",
            //    Description = "Ацетилсалициловая кислота (аспирин) применяется для лечения болевого синдрома слабой и средней интенсивности, при лихорадочных состояниях, ревматических заболеваниях. При назначении в средних дозах оказывает анальгезирующий и жаропонижающий эффекты."
            //};
            //Good good15 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки, вкриті оболонкою, по 10 мг № 10 (10х1), № 20 (10х2), № 100 (10х10) у блістерах</Value></Item><Item><Key>2</Key><Value>Ранбаксі Лабораторіз Лімітед, Індія КК Терапія АТ, Румунія</Value></Item><Item><Key>3</Key><Value>від 16 років</Value></Item><Item><Key>4</Key><Value>Короткочасне лікування болю помірної інтенсивності, включаючи післяопераційний біль.</Value></Item><Item><Key>5</Key><Value>	Підвищена чутливість до кеторолаку або до інших компонентів препарату. - Активна пептична виразка, нещодавня шлунково-кишкова кровотеча або перфорація, виразкова хвороба або шлунково-кишкова кровотеча в анамнезі; - бронхіальна астма, риніт, ангіоневротичний набряк або кропив’янка, спричинені застосуванням ацетилсаліцилової кислоти або іншими нестероїдними протизапальними засобами (через можливість виникнення тяжких анафілактичних реакцій); - бронхіальна астма в анамнезі; - не застосовувати як аналгезуючий засіб перед і під час значного оперативного втручання та після маніпуляцій на коронарних судинах; - тяжка серцева недостатність; - повний або частковий синдром носових поліпів, набряку Квінке або бронхоспазму; - не застосовувати пацієнтам, у яких було оперативне втручання з високим ризиком крововиливу або неповної зупинки кровотечі та пацієнтам, які отримують антикоагулянти, включаючи низькі дози гепарину (2500-5000 одиниць кожні 12 годин); - печінкова або помірна тяжка ниркова недостатність (рівень креатиніну в сироватці крові більше 160 мкмоль/л); - підозрювана або підтверджена цереброваскулярна кровотеча, геморагічний діатез, включаючи порушення згортання крові і високий ризик кровотечі; - одночасне лікування іншими нестероїдними протизапальними засобами (НПЗЗ) (включаючи селективні інгібітори циклооксигенази), ацетилсаліциловою кислотою, варфарином, пентоксифіліном, пробенецидом або солями літію; - гіповолемія, дегідратація; - ризик виникнення ниркової недостатності внаслідок зменшення об’єму рідини.</Value></Item><Item><Key>6</Key><Value>діюча речовина: ketorolac tromethamine; 1 таблетка, вкрита оболонкою, містить кеторолаку трометаміну 10 мг; допоміжні речовини: целюлоза мікрокристалічна, крохмаль кукурудзяний, кремнію діоксид колоїдний безводний, магнію стеарат, гідроксипропілметилцелюлоза, макрогол 400, тальк, титану діоксид (Е 171).</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>КЕТАНОВ</Value></Item><Item><Key>9</Key><Value>блістер</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні і протиревматичні засоби</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Кетанов №100 таблетки",
            //    Price = 447.55m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/ad0/650_400_1/ad0d02b92f52096dcbf68bb90336751e.JPG",
            //    UrlLink = "https://www.apteka24.ua/ketanov-tabletki-n100/",
            //    Description = "Кеторолак действует на циклооксигеназный путь обмена арахидоновой кислоты, ингибируя биосинтез простагландинов. Кеторолак имеет обезболивающее и противовоспалительное действие, однако его системное обезболивающее действие значительно превышает противовоспалительный эффект. Как и другие НПВЛ, кеторолак угнетает агрегацию тромбоцитов, вызванную арахидоновой кислотой и коллагеном, и не влияет на АТФ - индуцированную агрегацию тромбоцитов. Кеторолак удлиняет среднее время кровотечения, но не влияет на количество тромбоцитов, протромбиновое время или частичное тромбопластиновое время."
            //};
            //Good good16 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Супозиторії по 50 мг № 5 (5х1), № 10 (5х2) у блістерах</Value></Item><Item><Key>2</Key><Value>БЕРЛІН-ХЕМІ АГ, Німеччина</Value></Item><Item><Key>3</Key><Value>від 14 років.</Value></Item><Item><Key>4</Key><Value>Запальні і дегенеративні форми ревматизму: ревматоїдний артрит, ювенільний ревматоїдний артрит, анкілозуючий спондиліт, остеоартрит, включаючи спондилоартрит; · больові синдроми з боку хребта; · ревматичні захворювання позасуглобових м’яких тканин; · посттравматичні і післяопераційні больові синдроми, що супроводжуються запаленням і набряком, зокрема після стоматологічних та ортопедичних операцій; · гінекологічні захворювання, які супроводжуються больовим синдромом і запаленням, наприклад, первинна дисменорея та аднексит; · напади мігрені; · гострі напади подагри; · як допоміжний засіб при тяжких запальних захворюваннях ЛОР-органів, які супроводжуються болісним відчуттям, наприклад, при фаринготонзиліті, отиті. Відповідно до загальних терапевтичних принципів, основне захворювання слід лікувати засобами базисної терапії. Гарячка сама по собі не є показанням для застосування препарат</Value></Item><Item><Key>5</Key><Value>Гіперчутливість до діючої речовини або до будь-якого іншого компонента препарату; · гостра виразка шлунка або кишечнику; гастроінтенстинальна кровотеча або перфорація; · високий ризик розвитку післяопераційних кровотеч, незгортання крові, порушень гемостазу, гемопоетичних порушень чи цереброваскулярних кровотеч; · кровотеча або перфорація шлунково-кишкового тракту в анамнезі, що пов’язані з попереднім лікуванням нестероїдними протизапальними препаратами (НПЗП); · активна форма виразкової хвороби/кровотечі або рецидивуюча виразкова хвороба/кровотеча в анамнезі (два або більше окремих епізоди діагностованої виразки або кровотечі); · запальні захворювання кишечнику (наприклад, хвороба Крона або виразковий коліт); · останній триместр вагітності; · печінкова недостатність; · ниркова недостатність; · застійна серцева недостатність (NYHA II-IV); · ішемічна хвороба серця у пацієнтів, які мають стенокардію, перенесений інфаркт міокарда; · цереброваскулярні захворювання у пацієнтів, які перенесли інсульт, або мають епізоди транзиторних ішемічних атак; · захворювання периферичних артерій; · лікування періопераційного болю при аорто-коронарному шунтуванні (або використання апарату штучного кровообігу); · як і інші НПЗП, диклофенак також протипоказаний пацієнтам, у яких застосування ібупрофену, ацетилсаліцилової кислоти або інших не стероїдних протизапальних препаратів провокує напади бронхіальної астми, ангіоневротичного набряку, кропив’янки або гострого риніту. · проктит.</Value></Item><Item><Key>6</Key><Value>діюча речовина: 1 супозиторій містить диклофенаку натрію 50 мг; допоміжні речовини: пропілгалат, етанол 96 %, крохмаль кукурудзяний, жир тверди</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>ДИКЛОБЕРЛ® 50</Value></Item><Item><Key>9</Key><Value>блістер</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні та протиревматичні засоби. Код АТХ М01А В05.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Диклоберл 50 мг №10 свечи",
            //    Price = 76.97m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/6c3/650_400_1/6c3cf4a1d542b741bb321441b3559ce9.jpg",
            //    UrlLink = "https://www.apteka24.ua/dikloberl-supp-50mg-n10/",
            //    Description = "Диклофенак проникає у синовіальну рідину, де його максимальна концентрація досягається на  2-4 години пізніше, ніж у плазмі крові. Уявний період напіввиведення із синовіальної рідини становить 3-6 годин. Через 2 години після досягнення максимальних концентрацій у плазмі крові концентрація диклофенаку в синовіальній рідині залишається більш високою, ніж у плазмі крові; це явище спостерігається впродовж 12 годин."
            //};
            //Good good17 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Розчин для ін'єкцій, 75 мг/3 мл по 3 мл в ампулах № 5</Value></Item><Item><Key>2</Key><Value>КРКА, д.д., Ново место, Словенія</Value></Item><Item><Key>3</Key><Value>не застосовувати дітям</Value></Item><Item><Key>4</Key><Value>Препарат при внутрішньом’язовому введенні призначений для лікування: Запальних та дегенеративних форм ревматизму, ревматоїдного артриту, анкілозуючого спондиліту, остеоартриту, спондилоартриту, вертебрального больового синдрому, несуглобового ревматизму; гострих нападів подагри; ниркової та біліарної колік; болю та набряку після травм і операцій; тяжких нападів мігрені. Препарат при введенні у вигляді внутрішньовенних інфузій призначений для лікування або профілактики післяопераційного болю.</Value></Item><Item><Key>5</Key><Value>Відома гіперчутливість до діючої речовини, натрію метабісульфіту або до будь-яких інших компонентів препарату. Кровотеча або перфорація шлунково-кишкового тракту в анамнезі, пов’язана з попереднім лікуванням нестероїдними протизапальними засобами (НПЗЗ). Активна форма виразкової хвороби/кровотечі або рецидивуюча виразкова хвороба/кровотеча в анамнезі (два або більше окремих епізоди встановленої виразки або кровотечі). Печінкова недостатність. Ниркова недостатність. Застійна серцева недостатність (NYHA ІІ-ІV). III триместр вагітності. Як і інші НПЗЗ, диклофенак також протипоказаний пацієнтам, у яких застосування ібупрофену, ацетилсаліцилової кислоти або інших нестероїдних протизапальних препаратів провокує напади бронхіальної астми, ангіоневротичного набряку, кропив’янки або гострого риніту. Запальні захворювання кишечнику (наприклад хвороба Крона або виразковий коліт). Високий ризик розвитку післяопераційних кровотеч, незгортання крові, порушень гемостазу, гемопоетичних порушень чи цереброваскулярних кровотеч. Лікування періопераційного болю при аортокоронарному шунтуванні (або використання апарату штучного кровообігу). Ішемічна хвороба серця у пацієнтів, які мають стенокардію, перенесений інфаркт міокарда. Цереброваскулярні захворювання у пацієнтів, які перенесли інсульт або мають епізоди транзиторних ішемічних атак. Захворювання периферичних артерій. У даній лікарській формі препарат протипоказаний дітям. Тільки щодо внутрішньовенного застосування. Одночасне застосування НПЗЗ або антикоагулянту (в тому числі низьких доз гепарину). Наявність в анамнезі геморагічного діатезу, підтверджена або підозрювана цереброваскулярна кровотеча в анамнезі. Операції, пов’язані з високим ризиком кровотечі. Бронхіальна астма в анамнезі. Помірне або тяжке порушення функцій нирок (креатинін сироватки крові > 160 мкмоль/л). Гіповолемія або зневоднення з будь-якої причини.</Value></Item><Item><Key>6</Key><Value>діюча речовина: 3 мл розчину (1 ампула) містять диклофенаку натрію – 75 мг; допоміжні речовини: спирт бензиловий, пропіленгліколь, натрію метабісульфіт (Е 223), натрію гідроксид, вода для ін’єкцій.</Value></Item><Item><Key>7</Key><Value>5 роки</Value></Item><Item><Key>8</Key><Value>НАКЛОФЕН</Value></Item><Item><Key>9</Key><Value>ампула</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні та протиревматичні засоби. Диклофенак. Код АТХ М01А В05.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Наклофен ДУО 75 мг №20 капсулы",
            //    Price = 116.88m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/40f/650_400_1/40fa974edf0fe9b73f531f19fc47f3e9.JPG",
            //    UrlLink = "https://www.apteka24.ua/naklofen-duo-kapsuly-75mg-n20/",
            //    Description = "Препарат Наклофен ДУО 75 мг №20 является одним из самых действенных препаратов нестероидного типа, способствующих устранению спазмов и болей ревматического характера. Ввиду серьезного влияния препарата Наклофен ДУО на работу организма его продажа в аптеках Украины происходит строго по рецепту."
            //};
            //Good good18 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки по 100 мг № 20 (10х2) у блістерах</Value></Item><Item><Key>2</Key><Value>Д-р Редді'с Лабораторіс Лтд (виробнича дільниця - ІІ), Індія Д-р Редді'с Лабораторіс Лімітед, Індія</Value></Item><Item><Key>3</Key><Value>від 12 років.</Value></Item><Item><Key>4</Key><Value>Лікування гострого болю. Лікування первинної дисменореї. Німесулід слід застосовувати тільки у якості препарату другої лінії. Рішення про призначення німесуліду слід приймати на основі оцінки усіх ризиків для конкретного пацієнта.</Value></Item><Item><Key>5</Key><Value>Відома підвищена чутливість до німесуліду або до будь-якого компонента препарату. Гіперергічні реакції, які мали місце у минулому (бронхоспазм, риніт, кропив’янка) у зв’язку з застосуванням ацетилсаліцилової кислоти чи інших нестероїдних протизапальних препаратів. Гепатотоксичні реакції на німесулід, які мали місце у минулому. Супутнє застосування інших речовин з потенційною гепатотоксичністю. Алкоголізм та наркотична залежність. Підозра на гостру хірургічну патологію. Шлунково-кишкові кровотечі або перфорації в анамнезі, пов’язані з попереднім застосуванням нестероїдних протизапальних засобів. Виразка шлунка або дванадцятипалої кишки у фазі загострення, наявність в анамнезі виразки, перфорації або кровотечі у травному тракті. Наявність в анамнезі цереброваскулярних кровотеч або інших крововиливів, а також захворювань, що супроводжуються кровоточивістю. Тяжкі порушення згортання крові. Тяжка серцева недостатність. Тяжкі порушення функції нирок. Порушення функції печінки. Хворі з підвищеною температурою тіла та/або грипоподібними симптомами. Діти віком до 12 років. ІІІ триместр вагітності та період годування груддю.</Value></Item><Item><Key>6</Key><Value>діюча речовина: nimesulide; 1 таблетка містить німесуліду 100 мг; допоміжні речовини: кальцію гідрофосфат, целюлоза мікрокристалічна, крохмаль кукурудзяний, натрію крохмальгліколят (тип А), кремнію діоксид колоїдний безводний, тальк, магнію стеарат.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>НАЙЗ®</Value></Item><Item><Key>9</Key><Value>блістер</Value></Item><Item><Key>10</Key><Value>Нестероїдні протизапальні та протиревматичні препарати</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Найз 100 мг №20 таблетки",
            //    Price = 50.05m,
            //    ImgLink = "https://www.apteka24.ua/upload/iblock/354/35492b2d9eab1f8cf16915582d79b174.jpg",
            //    UrlLink = "https://www.apteka24.ua/nayz-tabletki-100mg-n20/",
            //    Description = "аблетки Найз 100 мг №20 – лекарственное средство на основе нимесулида, обладающего различными свойствами, такими как: болеутоляющие, противовоспалительные, понижающие температуру. Также активный компонент медикамента осуществляет ингибирование высвобождения фермента миелопероксидазы, угнетение образования свободных кислородных радикалов и факторов опухолевого некроза, и прочих воспалительных медиаторов, при этом не оказывая влияния на фагоцитарные хемотаксические процессы."
            //};
            //Good good19 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>мазь по 50 г у тубах № 1</Value></Item><Item><Key>2</Key><Value>АТ Талліннський фармацевтичний завод, Естонія</Value></Item><Item><Key>3</Key><Value>не застосовувати дітям</Value></Item><Item><Key>4</Key><Value>Болезаспокійливий засіб для зовнішнього застосування при болю у суглобах та м’язах.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до будь-якого компонента мазі, ацетилсаліцилової кислоти або до інших не стероїдних протизапальних лікарських засобів. Бронхіальна астма. Коклюш. Схильність до бронхоспазму. Схильність до судом. Виразки та інші шкірні захворювання. Гострий туберкульоз легенів. Порушення мозкового та коронарного кровообігу. Схильність до виникнення ангіоспазмів. Тяжкі порушення функцій нирок або печінки. Гарячка. Загальна втомлюваність.</Value></Item><Item><Key>6</Key><Value>	діючі речовини: отрута гадюки звичайної суха, камфора рацемічна, олія терпентинна, кислота саліцилова; 1 г мазі містить 0,05 МОД отрути гадюки звичайної сухої, 30 мг камфори рацемічної, 30 мг олії терпентинної, 10 мг кислоти саліцилової; допоміжні речовини: парафін білий м’який, спирт цетостеариловий, парафін, натрію цетостеарилсульфат, гліцерин, натрію хлорид, вода очищена.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>ВИПРОСАЛ В®</Value></Item><Item><Key>9</Key><Value>туба</Value></Item><Item><Key>10</Key><Value>Засоби, що застосовують місцево при болю у суглобах та м’язах. Код АТХ М02А Х10.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Випросал В 50 г мазь",
            //    Price = 110.7m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/87a/650_400_1/87aede0de98a26548e6d17073ac171c0.JPG",
            //    UrlLink = "https://www.apteka24.ua/viprosal-v-maz-50g/",
            //    Description = "Помогает купировать болевой синдром при артритах. Активными компонентами препарата, согласно описанию Випросал В являются: ацетилсалициловая кислота, эфирное масло сосновой хвои, яд гадюки, камфора и скипидар. Такой состав обеспечивает местнораздражающее действие, хорошо обезболивает. Обеспечивает приток крови к эпидермальным клеткам за счет греющего эффекта, тем самым улучшая снабжение тканей необходимыми веществами."
            //};
            //Good good20 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки по 4 таблетки у стрипі; по 1 стрипу в паперовому конверті; по 4 таблетки у стрипі; по 3 стрипи у картонній коробці; по 4 таблетки у стрипі; по 1 стрипу в паперовому конверті; по 50 конвертів у картонній коробці</Value></Item><Item><Key>2</Key><Value>Наброс Фарма Пвт. Лтд., Індія</Value></Item><Item><Key>3</Key><Value>от 12 лет</Value></Item><Item><Key>4</Key><Value>Симптоматичне лікування застуди та грипу, які супроводжуються підвищеною температурою тіла, ознобом, головним болем, нежитем та закладеністю носа, чханням, ломотою та болем у тілі.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до компонентів препарату, інших похідних ксантинів (теофілін, теобромін). Тяжкі серцево-судинні захворювання, включаючи порушення провідності, виражений атеросклероз, тяжку форму ішемічної хвороби серця. Тяжкі порушення функції печінки та/або нирок, вроджена гіпербілірубінемія, тяжка артеріальна гіпертензія; аденома простати з утрудненим сечовипусканням; обструкція шийки сечового міхура; захворювання крові, виражена анемія, лейкопенія, гіпертиреоз, пілородуоденальна обструкція, цукровий діабет, бронхіальна астма, закритокутова глаукома, дефіцит глюкозо-6-фосфатдегідрогенази, алкоголізм, підвищена збудливість, порушення сну, супутнє лікування інгібіторами МАО та протягом 2 тижнів після припинення їх застосування. Літній вік.</Value></Item><Item><Key>6</Key><Value>1 таблетка містить парацетамолу 500 мг, кофеїну 30 мг, фенілефрину гідрохлориду 5 мг, хлорфеніраміну малеату 2 мг; допоміжні речовини: крохмаль кукурудзяний, натрію крохмальгліколят (тип А), тальк, желатин, магнію стеарат, сорбіту розчин (Е 420), Повідон К-30, натрію бензоат (Е 211), барвник Ponceau 4R (Е 124), вода очищена.</Value></Item><Item><Key>7</Key><Value>4 роки</Value></Item><Item><Key>8</Key><Value>Парацетамол®-N</Value></Item><Item><Key>9</Key><Value>стрипу в паперовому конверті</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Парацетамол, комбінації без психолептиків</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Парацетамол 200 мг №10 таблетки Галичфарм",
            //    Price = 6.15m,
            //    ImgLink = "https://www.apteka24.ua/upload/iblock/fae/faef60b93443d90e33e436053a8643fe.png",
            //    UrlLink = "https://www.apteka24.ua/paratsetamol-200-mg-10-1/",
            //    Description = "Больовий синдром слабкої і помірної інтенсивності різного генезу: головний біль, включаючи мігрень та головний біль напруження, біль у спині, ревматичний біль, біль у м’язах, періодичні болі у жінок, невралгії, зубний біль; полегшення симптомів застуди та грипу таких як гарячка, ломота."
            //};
            //Good good21 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Розчин для ін'єкцій по 2 мл або по 5 мл в ампулі № 5, № 10</Value></Item><Item><Key>2</Key><Value>АТ \"Софарма\", Болгарія</Value></Item><Item><Key>3</Key><Value>Від 15 років</Value></Item><Item><Key>4</Key><Value>	Для короткочасного симптоматичного лікування больового синдрому при спазмах гладкої мускулатури внутрішніх органів: · шлункові та кишкові коліки; · ниркові коліки при нирковокам’яній хворобі; · спастична дискінезія жовчних шляхів; · дисменорея.</Value></Item><Item><Key>5</Key><Value>	Гіперчутливість до активних речовин, до похідних піразолону (в тому числі у пацієнтів з агранулоцитозом в анамнезі при попередньому застосуванні подібних ліків) або до інших нестероїдних протизапальних засобів (НПЗЗ). Тяжкі порушення функцій печінки і нирок. Гостра печінкова порфірія. Дефіцит глюкозо-6-фосфатдегідрогенази. Непрохідність шлунково-кишкового тракту і мегаколон. Порушення функцій кісткового мозку (наприклад, після лікування цитостатиками). Захворювання гемопоетичної системи (агранулоцитоз, лейкопенія, анемія будь-якої етіології, у тому числі апластична анемія, інфекційна нейтропенія). Аденома передміхурової залози II і III ступеня. Атонія жовчного і сечового міхура. Підозра на хірургічну патологію. Гіпотонічні стани і гемодинамічна нестабільність. Колаптоїдні стани. Тахіаритмія. Закритокутова глаукома. Бронхіальна астма.</Value></Item><Item><Key>6</Key><Value>діючі речовини: метамізол натрію моногідрат, пітофенону гідрохлорид, фенпіверинію бромід; 1 мл розчину для ін’єкцій містить: метамізолу натрію моногідрату 500 мг; пітофенону гідрохлориду 2 мг; фенпіверинію броміду 0,02 мг; допоміжні речовини: вода для ін’єкцій</Value></Item><Item><Key>7</Key><Value>4 роки</Value></Item><Item><Key>8</Key><Value>СПАЗМАЛГОН®</Value></Item><Item><Key>9</Key><Value>ампула</Value></Item><Item><Key>10</Key><Value>Спазмолітичні засоби в комбінації з аналгетиками</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Спазмалгон 5 мл №10 раствор для инъекций",
            //    Price = 327.06m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/4ef/650_400_1/4eff5a89fb281461c594defad92773a4.JPG",
            //    UrlLink = "https://www.apteka24.ua/spazmalgon-5-ml-n10/",
            //    Description = "Спазмалгон – один из самых популярных спазмолитиков, который не имеет аналогов по скорости облегчающего воздействия на организм. Спазмалгон – это очень эффективный препарат, который должен быть в домашней аптечке каждого жителя Украины. Но прежде, чем купить Спазмалгон 5 мл, необходимо проконсультироваться с лечащим врачом и убедиться в возможности использования Спазмалгона. Это связано с тем, что существуют определённые противопоказания, к тому же при внутривенном введении лекарства могут возникнуть непредвиденные побочные действия. "
            //};
            //Good good22 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Капсули № 30, № 60, № 120 у флаконі</Value></Item><Item><Key>2</Key><Value>Контракт Фармакал Корпорейшн, США</Value></Item><Item><Key>3</Key><Value>від 16 років</Value></Item><Item><Key>4</Key><Value>У зв’язку з тим, що досвіду застосування дітям недостатньо, не рекомендується застосовувати дітям.</Value></Item><Item><Key>5</Key><Value>Гіперчутливість до активних речовин, до похідних піразолону (в тому числі у пацієнтів з агранулоцитозом в анамнезі при попередньому застосуванні подібних ліків) або до інших нестероїдних протизапальних засобів (НПЗЗ). Тяжкі порушення функцій печінки і нирок. Гостра печінкова порфірія. Дефіцит глюкозо-6-фосфатдегідрогенази. Непрохідність шлунково-кишкового тракту і мегаколон. Порушення функцій кісткового мозку (наприклад, після лікування цитостатиками). Захворювання гемопоетичної системи (агранулоцитоз, лейкопенія, анемія будь-якої етіології, у тому числі апластична анемія, інфекційна нейтропенія). Аденома передміхурової залози II і III ступеня. Атонія жовчного і сечового міхура. Підозра на хірургічну патологію. Гіпотонічні стани і гемодинамічна нестабільність. Колаптоїдні стани. Тахіаритмія. Закритокутова глаукома. Бронхіальна астма.</Value></Item><Item><Key>6</Key><Value>діючі речовини: D-глюкозаміну гідрохлорид та натрію хондроїтину сульфат; 1 капсула містить 500 мг D-глюкозаміну гідрохлориду, 400 мг натрію хондроїтину сульфату; допоміжні речовини: желатин, кислота стеаринова, магнію стеарат, марганцю сульфат моногідрат.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>ТЕРАФЛЕКС</Value></Item><Item><Key>9</Key><Value>флакон</Value></Item><Item><Key>10</Key><Value>Засоби, що застосовуються при патології опорно-рухового апарату. Код АТХ М09А Х.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Терафлекс N120 капсулы",
            //    Price = 524.2m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/366/650_400_1/3665b7e5c2faf73ace0b725af9f3a4a0.JPG",
            //    UrlLink = "https://www.apteka24.ua/terafleks-kapsuly-n120/",
            //    Description = "Терафлекс показано при переломах, чтобы быстрее заживали поврежденные кости. Это основная причина назначения данного препарата. Купить Терафлекс возможно без предписания и рецепта. Не рекомендовано начинать принимать препарат без назначения врача. Особенно осторожным следует быть больным сахарным диабетом и бронхиальной астмой, подчеркивают отзывы о Терафлекс."
            //};
            //Good good23 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Суспензія оральна, 120 мг/5 мл по 100 мл у флаконах № 1</Value></Item><Item><Key>2</Key><Value>Фармаклер, Франція</Value></Item><Item><Key>3</Key><Value>Не застосовувати препарат дітям віком до 2 місяців. Рекомендується застосовувати дітям віком від 2 місяців до 12 років.</Value></Item><Item><Key>4</Key><Value>Біль під час прорізування зубів, зубний біль, біль у горлі, гарячка при застуді, грипі та дитячих інфекціях, таких як вітрянка, коклюш, кір, паротит (свинка). Препарат також рекомендований для лікування поствакцинальної гіпертермії у немовлят віком 2-3 місяці.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до компонентів препарату, тяжкі порушення функції печінки та/або нирок, вроджена гіпербілірубінемія, дефіцит глюкозо-6-фосфатдегідрогенази, алкоголізм, захворювання крові, виражена анемія, лейкопенія. Рідкісна спадкова непереносимість фруктози. Дитячий вік до 2 місяців.</Value></Item><Item><Key>6</Key><Value>	діюча речовина: 5 мл суспензії містять 120 мг парацетамолу; допоміжні речовини: кислота яблучна, азорубін (Е 122), ксантанова камедь, мальтит рідкий, ароматизатор полуничний, сорбіту розчин, що кристалізується, натрію етилпарагідроксибензоат (Е 215), натрію пропілпарагідроксибензоат (Е 217), натрію метилпарагідроксибензоат (Е 219), сорбіт (Е 420), кислота лимонна безводна, вода очищена.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>ПАНАДОЛ® БЕБІ</Value></Item><Item><Key>9</Key><Value>флакон</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Парацетамол. Код АТХ N02B E01.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Панадол Беби 100 мл суспензия",
            //    Price = 49.99m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/82a/650_400_1/82a91686f168b9fee11fe12847806b4a.JPG",
            //    UrlLink = "https://www.apteka24.ua/panadol-bebi-100ml/",
            //    Description = "Известное и популярное лекарство - Панадол Беби 100 мл – производится в виде вязкой гомогенизированной жидкости, имеющей аромат и привкус клубники, розоватого цвета во флаконе с пластиковым мерным шприцем. Используется для снижения температуры, обезболивающего и антивоспалительного эффекта у детей."
            //};
            //Good good24 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Таблетки шипучі № 10 (2х5) у стрипах</Value></Item><Item><Key>2</Key><Value>Байєр Біттерфельд ГмбХ, Німеччина</Value></Item><Item><Key>3</Key><Value>Препарат застосовують дітям віком від 15 років.</Value></Item><Item><Key>4</Key><Value>	Незначний або помірний біль, такий як головний біль, зубний біль, періодичні болі у жінок, больові симптоми, пов’язані з застудою (наприклад, головний біль, біль у горлі, біль у кінцівках). -Гарячка.</Value></Item><Item><Key>5</Key><Value>Гіперчутливість до ацетилсаліцилової кислоти, інших саліцилатів, аскорбінової кислоти або до будь-якого компонента препарату. - Бронхіальна астма, спричинена застосуванням саліцилатів або інших НПЗЗ в анамнезі. - Гострі шлунково-кишкові виразки. - Геморагічний діатез. - Тяжкі захворювання нирок; виражена ниркова недостатність. - Сечокам’яна хвороба. - Виражена печінкова недостатність. - Виражена серцева недостатність. - Схильність до тромбозів, тромбофлебіт. - Цукровий діабет. - Комбінація з метотрексатом у дозуванні 15 мг/тиждень або більше (див. розділ «Взаємодія з іншими лікарськими засобами та інші види взаємодій»).</Value></Item><Item><Key>6</Key><Value>	діючі речовини: ацетилсаліцилова кислота та аскорбінова кислота; 1 таблетка містить 400 мг ацетилсаліцилової кислоти та 240 мг аскорбінової кислоти (вітаміну С); допоміжні речовини: натрію дигідроцитрат, натрію гідрокарбонат, кислота лимонна безводна, натрію карбонат безводний.</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>Анальгин В</Value></Item><Item><Key>9</Key><Value>Стрип</Value></Item><Item><Key>10</Key><Value>Аналгетики та антипіретики. Кислота ацетилсаліцилова. Код АТХ N02В А01.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Анальгин Дарница 0.5г № 10 таблетки",
            //    Price = 6.45m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/c32/650_400_1/c3207bb3a832b139babba39a6aa33d4c.jpg",
            //    UrlLink = "https://www.apteka24.ua/analgin-darnitsa-0-5-n10/",
            //    Description = "Анальгин Дарница – таблетки, которые обладают сильным обезболивающим эффектом, а также оказывает противовоспалительное и жаропонижающее действие. Важно, что данный препарат действует очень быстро благодаря высокой всасываемости. Поэтому применение Анальгина позволяет быстро обеспечить анальгезирующий эффект, буквально в течение нескольких минут. Это свойство выгодно отличает данный препарат от некоторых аналогов Анальгина. "
            //};
            //Good good25 = new Good()
            //{
            //    XmlData = "<?xml version=\"1.0\" encoding=\"utf - 8\"?><PropertyValuesDTO type=\"Model.DTO.PropertyValuesDTO\"><DictStringProperties><Item><Key>1</Key><Value>Реєстраційне посвідчення</Value></Item><Item><Key>2</Key><Value>Меркле ГмбХ, Німеччина</Value></Item><Item><Key>3</Key><Value>Препарат не призначати дітям через обмежений досвід застосування.</Value></Item><Item><Key>4</Key><Value>Долобене гель застосовувати з метою лікування: – травм (у тому числі спортивних), гематом, ушкоджень м’язів, періартикулярних структур або суглобів (без ураження шкіри); – тендинітів та тендовагінітів, бурситу, плечолопаткового періартриту та епікондиліту плеча (патологічна основа клінічного синдрому «лікоть тенісиста»); – гострої невралгії.</Value></Item><Item><Key>5</Key><Value>Підвищена чутливість до будь-яких компонентів препарату; – виражені порушення функції печінки та/або нирок; – бронхіальна астма; – нестабільна гемодинаміка; – виражені порушення з боку серцево-судинної системи (виражена стенокардія, інфаркт міокарда, інсульт, виражений загальний атеросклероз); – трофічні виразки ніг, що кровоточать, відкриті та/або інфіковані рани, геморагічний діатез, пурпура, тромбоцитопенія, гемофілія, схильність до кровотеч; – коматозні стани, глаукома, катаракта.</Value></Item><Item><Key>6</Key><Value>діючі речовини: гепарин натрію, диметилсульфоксид, декспантенол; 100 г гелю містить гепарину натрію 50000 МО; диметилсульфоксиду 15 г; декспантенолу 2,5 г; допоміжні речовини: кислота поліакрилова, трометамол, макроголу гліцерилгідроксистеарат, спирт ізопропіловий, олія розмаринова, олія сосни високогірної, олія цитронелова, вода очищена</Value></Item><Item><Key>7</Key><Value>3 роки</Value></Item><Item><Key>8</Key><Value>ДОЛОБЕНЕ</Value></Item><Item><Key>9</Key><Value>туба</Value></Item><Item><Key>10</Key><Value>Засоби для місцевого застосування при болю у суглобах та м’язах.</Value></Item></DictStringProperties><DictIntProperties /><DictDoubleProperties /></PropertyValuesDTO>",
            //    Category_Id = 3,
            //    WebShop_Id = 1,
            //    Status = true,
            //    Name = "Долобене 20 г гель",
            //    Price = 80.95m,
            //    ImgLink = "https://www.apteka24.ua/upload/resize_cache/iblock/f47/650_400_1/f47e263bc704358755dae13ef08481e5.JPG",
            //    UrlLink = "https://www.apteka24.ua/dolobene-gel-20g/",
            //    Description = "Препарат Долобене, що містить диметилсульфоксид, не можна застосовувати із суліндаком (нестероїдний протизапальний засіб) через можливість виникнення тяжких токсичних реакцій (периферичної нейропатії)."
            //};
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good1));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good2));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good3));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good4));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good5));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good6));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good7));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good8));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good9));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good10));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good11));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good12));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good13));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good14));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good15));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good16));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good17));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good18));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good19));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good20));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good21));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good22));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good23));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good24));
            //elasticManager.Insert(Mapper.Map<GoodDTO>(good25));

            int pageSize = 7;
			var goods = goodManager.GetAll();
			var categories = categoryManager.GetAll().Where(t => t.HasChildrenCategories).ToList();
			var goods_list = goodManager.GetAll();

			foreach (var item in goods_list)
			{
				item.Category = categoryManager.Get(item.Category_Id);

				item.WebShop = shopManager.GetById(item.WebShop_Id);
			}
			int pageNumber = (page ?? 1);
			var Custom_model = new IndexViewDTO()
			{
				CategoryList = categories,
				GoodList = goods_list.ToPagedList(pageNumber, pageSize)
            };
			ModelState.Clear();			
			return View(Custom_model);
			
		}

		public ActionResult About()
		{
			ViewBag.Message = "Your application description page.";

			return View();
		}

		public ActionResult Contact()
		{
			ViewBag.Message = "Your contact page.";

			return View();
		}
		public ActionResult PriceStat()
		{

			return View();
		}


		/// <summary>
		/// Get data from PriceHistory table of database.
		/// </summary>
		/// <param name="url_one"></param>
		/// <param name="year"></param>
		/// <returns></returns>
		public JsonResult getLineChartData(string url_one, string year)
		{
			var iData = new List<object>();
			var labels = new List<string>();
			var lst_dataItem_1 = new List<decimal?>();
			var labels_q = priceManager.GetAll().Where(i => i.Url == url_one && i.Date.Year.ToString() == year).Select(i => i.Date).
			OrderBy(x => x.Month).ThenBy(x=>x.Day).
			Select(m => m.Date.ToString("dd/MM/yyyy")).Distinct().ToList();	
			var price_lst = priceManager.GetAll().Where(i => i.Url == url_one && i.Date.Year.ToString() == year).Select(i => i.Price).ToList();
			if (price_lst.Count == 1 && labels_q.Count == 1)
			{
				var dd_n = new DateTime(DateTime.Now.Year,DateTime.Now.Month,DateTime.Now.Day).ToString("dd/MM/yyyy");
				var curr_p = price_lst[0];
				lst_dataItem_1.Add(curr_p);
				labels.AddRange(labels_q);
				labels.Add(dd_n);
				lst_dataItem_1.AddRange(price_lst);
			}
			else
			{
				lst_dataItem_1.AddRange(price_lst);
				labels.AddRange(labels_q);
			}
			iData.Add(labels);
			iData.Add(lst_dataItem_1);

			return Json(iData);
		}


        public JsonResult GetExactGoods(string term)
        {
            var list = elasticManager
                .GetByPrefix(term, 3)
                .Select(x=> new {value = x.Name}).Distinct();
            return Json(list, JsonRequestBehavior.AllowGet);
        }

    }
}